## Python for Data Science:3 Pandas
## Pandas contain high-level data structures and manipulation tools to make data analysis fast and easy in Python.

In [1]:
import pandas as pd #I am importing pandas as pd
from pandas import Series, DataFrame # Series and Data Frame are two data structures available in python

#Series
#Series is a one dimensional array like object with index no

In [4]:
ser=Series([1,3,5,7,9])

In [5]:
print (ser)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [7]:
print (ser.index)

RangeIndex(start=0, stop=5, step=1)

In [9]:
jeeva = Series([5,4,3,2,1,-7,-29], index =['a','b','c','d','e','f','h']) # The index is specified
print (jeeva)# try jeeva.index and jeeva.values
print (jeeva['a']) # selecting a particular value from a Series, by using index

a     5
b     4
c     3
d     2
e     1
f    -7
h   -29
dtype: int64
5

In [10]:
jeeva['d'] = 9 # change the value of a particular element in series
print (jeeva)
jeeva[['a','b','c']] # select a group of values

a     5
b     4
c     3
d     9
e     1
f    -7
h   -29
dtype: int64

a    5
b    4
c    3
dtype: int64

In [12]:
print (jeeva[['a','b','c']])

a    5
b    4
c    3
dtype: int64

In [14]:
print (jeeva[jeeva>0]) # returns only the positive values
print (jeeva *2) # multiplies 2 to each element of a series

a    5
b    4
c    3
d    9
e    1
dtype: int64
a    10
b     8
c     6
d    18
e     2
f   -14
h   -58
dtype: int64

In [15]:
import numpy as np
np.mean(jeeva) # you can apply numpy functions to a Series

-2.0

In [16]:
player_salary ={'Rooney': 50000, 'Messi': 75000, 'Ronaldo': 85000, 'Fabregas':40000, 'Van persie': 67000} 
new_player = Series(player_salary)# converting a dictionary to a series,the series has keys/index of a dictionary
print (new_player)

Rooney        50000
Messi         75000
Ronaldo       85000
Fabregas      40000
Van persie    67000
dtype: int64

In [17]:
players =['Klose', 'Messi', 'Ronaldo', 'Van persie', 'Ballack'] 
player_1 =Series(player_salary, index= players) # I have changed the index of the Series. Since, no value was not found for Klose and Ballack, it appears as NAN
print (player_1)

Klose             NaN
Messi         75000.0
Ronaldo       85000.0
Van persie    67000.0
Ballack           NaN
dtype: float64

In [19]:
player_2 = player_1[~(np.isnan(player_1))]

In [20]:
print (player_2)

Messi         75000.0
Ronaldo       85000.0
Van persie    67000.0
dtype: float64

In [21]:
np.mean(player_2)

75666.66666666667

#DataFrame
#Data frame is a spread sheet like structure,Data frame has both row index and column index.

In [24]:
states ={'State' :['QLD', 'SA', ' NSW', 'VIC', 'TAS'],
                  'Population': [36, 44, 67,89,34],
                  'Capital' :['BNE', 'ADL', 'SYD', 'MELB', 'HOB']}
Australia = DataFrame(states) # creating a data frame
Australia

  State  Population Capital
0   QLD          36     BNE
1    SA          44     ADL
2   NSW          67     SYD
3   VIC          89    MELB
4   TAS          34     HOB

In [25]:
DataFrame(Australia, columns=['State', 'Capital', 'Population']) # change the sequence of column index

  State Capital  Population
0   QLD     BNE          36
1    SA     ADL          44
2   NSW     SYD          67
3   VIC    MELB          89
4   TAS     HOB          34

In [27]:
new_Aus = DataFrame(states, columns=['State', 'Capital', 'Population', 'Per Capita Income'], index =['a','b','c','d','e'])

In [28]:
new_Aus

  State Capital  Population Per Capita Income
a   QLD     BNE          36               NaN
b    SA     ADL          44               NaN
c   NSW     SYD          67               NaN
d   VIC    MELB          89               NaN
e   TAS     HOB          34               NaN

In [29]:
new_Aus['Per Capita Income'] = 99 # the empty per capita income column can be assigned a value
new_Aus

  State Capital  Population  Per Capita Income
a   QLD     BNE          36                 99
b    SA     ADL          44                 99
c   NSW     SYD          67                 99
d   VIC    MELB          89                 99
e   TAS     HOB          34                 99

In [ ]:
#Multivarient Binary Class Classification-Application of Pandas & Scipy
#https://github.com/smitraDA/Hands-on-Machine-Learning/blob/master/COVID%20Tester(%20Multivarient%20Binary%20Class%20Classification%20Model_Qadratic_Parametric_Normal).ipynb